In [1]:
import pandas as pd

In [2]:
df =pd.DataFrame({'key':['A','B','C','B','A','C','B'],
             'value':[1,3,4,6,2,3,3]})
df

  key  value
0   A      1
1   B      3
2   C      4
3   B      6
4   A      2
5   C      3
6   B      3

In [3]:
df.groupby('key').sum()

     value
key
A        3
B       12
C        7

In [4]:
"""也可以使用numpy来操作"""
import numpy as np
df.groupby('key').aggregate(np.sum)

     value
key
A        3
B       12
C        7

In [ ]:
"""读取文件"""
df = pd.read_csv('titanic.csv')
df.head()

In [ ]:
"""看一下男女获救的情况"""
df.groupby('Sex')['Survived'].mean()  #1是获救，0是未获救，所以平均值刚好是获救的概率

In [ ]:
"""看一下男女平均年龄"""
df.groupby('Sex')['Age'].mean()

In [5]:
"""看一下男女平均年龄"""
df.groupby('Sex')['Age'].mean()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
"""看一下男女获救的情况"""
df.groupby('Sex')['Survived'].mean()  #1是获救，0是未获救，所以平均值刚好是获救的概率

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [7]:
"""看一下男女平均年龄"""
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64